In [1]:
%load_ext sql
%sql postgres://jovyan:si330studentuser@localhost:5432/si330

'Connected: jovyan@si330'

* To get data out of the database and work with it we use the SELECT statement
* The select statement requires us at a minimum to indicate the columns we are interested in and the table we are interested in
* Base form is `SELECT cols FROM table`
* Note that the return value of the select statement is itself a relation (table)

In [ ]:
%load_ext sql
%sql postgres://jovyan:si330studentuser@localhost:5432/si330
import psycopg2
import sqlalchemy
engine = sqlalchemy.create_engine('postgres://jovyan:si330studentuser@localhost:5432/si330')
%sql drop table if exists person
pd.read_csv("person.csv").to_sql("person",engine)
%sql drop table if exists sales
pd.read_csv("sales.csv").to_sql("sales",engine)

In [3]:
%sql select first_name from person;
# we can limit this to a certain number of rows with the LIMIT clause
%sql select first_name from person limit 10;

 * postgres://jovyan:***@localhost:5432/si330
1000 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
10 rows affected.

[('Amanda',),
 ('Monica',),
 ('Keith',),
 ('Mark',),
 ('Amber',),
 ('Allison',),
 ('Cindy',),
 ('Paul',),
 ('Cynthia',),
 ('Brian',)]

* Statements in SQL are terminated with a semicolon, but when we are executing them in python the library which handles the connection will generally terminate the statement for us at the end of the line
* Notice that the return relation isn't sorted. It's up to the database to determine what order the items you get are in
* Beyond this, the database can choose any ten items when you make a limit call, there is no intrinsic ordering of your results, though some database vendors may choose to do so based on recency

In [4]:
# when you select multiple columns from a single database the results are row consistent, 
# e.g. the first name and last names align
%sql select first_name, last_name from person limit 5

 * postgres://jovyan:***@localhost:5432/si330
5 rows affected.

[('Amanda', 'Miller'),
 ('Monica', 'Jenkins'),
 ('Keith', 'Richards'),
 ('Mark', 'Cowan'),
 ('Amber', 'King')]

In [5]:
# it's common to use an * as a wildcard for any column
%sql select * from person limit 5

 * postgres://jovyan:***@localhost:5432/si330
5 rows affected.

[(0, 'Amanda', 'Miller', '4302 John Skyway Apt. 650', 'West Victor', 55311, 4910),
 (1, 'Monica', 'Jenkins', '2794 Danielle Skyway Suite 323', 'West Jenniferport', 91875, 910),
 (2, 'Keith', 'Richards', '395 Lloyd Route Apt. 439', 'Port Ashleyville', 1667, 9970),
 (3, 'Mark', 'Cowan', '4026 Timothy Court', 'New Sarah', 40411, 8764),
 (4, 'Amber', 'King', '74417 Warren Ways Apt. 647', 'South Kelly', 40440, 6046)]

In [8]:
# we can limit the results we want to return using a WHERE clouse
%sql select first_name from person where last_name='King' limit 5

 * postgres://jovyan:***@localhost:5432/si330
5 rows affected.

[('Amber',), ('Arthur',), ('Jon',), ('Raymond',), ('Jill',)]

In [9]:
# note the single quotes for strings in sql!
# there are two wildcard options with varchar matching in SQL:
# _ matches a single character
# % matches any number of characters
# to use these we must use the LIKE operator

# find all people who have a name which starts with Chris
%sql select first_name from person where first_name like 'Chris%' limit 5

 * postgres://jovyan:***@localhost:5432/si330
5 rows affected.

[('Christopher',),
 ('Christopher',),
 ('Christopher',),
 ('Christopher',),
 ('Christina',)]

In [10]:
%sql select first_name from person where first_name like 'Chris_' limit 5

 * postgres://jovyan:***@localhost:5432/si330
0 rows affected.

[]

* Unfortunatly, this form of string comparison is super limited. But it's pretty easy to optimize to be fast, so you should be aware of how to use it
* SQL has no regex functionality built into it :(
* (But the dirty truth is everyone loves regex so much you can use regex with a few custom functions)
* String matching is of course, case sensitive
* We can negate the like operator too with NOT

In [11]:
%sql select first_name from person where last_name not like 'K%' limit 5

 * postgres://jovyan:***@localhost:5432/si330
5 rows affected.

[('Amanda',), ('Monica',), ('Keith',), ('Mark',), ('Allison',)]

In [23]:
%sql select * from person where last_name like '___'

 * postgres://jovyan:***@localhost:5432/si330
26 rows affected.

[(47, 'Christopher', 'May', '45898 Jackson Islands', 'Mathewborough', 60118, 914),
 (74, 'Alexis', 'Lee', '50036 Bailey Pike', 'Youngborough', 72963, 3653),
 (130, 'Shelby', 'Liu', '743 Stacy Via', 'North Elizabethmouth', 82374, 1660),
 (183, 'Morgan', 'Ray', '8734 Brooke Divide', 'Sandraville', 60810, 5698),
 (201, 'Melissa', 'Ali', '77118 Smith Summit', 'North Edwardfort', 16904, 7493),
 (214, 'Jason', 'Lee', '486 Bridget Curve', 'Katiechester', 56051, 4306),
 (240, 'Eric', 'Ray', '59628 Meredith Wells', 'South Danielleberg', 91647, 8732),
 (258, 'Joel', 'Fox', '8402 James Extension Suite 811', 'Taylorchester', 61507, 8237),
 (281, 'Julie', 'Kim', '456 Beck Burg Apt. 452', 'Millerfurt', 5071, 5603),
 (339, 'Gregory', 'Fox', '6036 Jocelyn Dam', 'Frankville', 11087, 2373),
 (343, 'Jordan', 'Gay', '329 Hobbs Harbors Suite 451', 'West Dominiquehaven', 71686, 4041),
 (368, 'John', 'Lee', '30810 Hammond Ferry Suite 473', 'New Douglas', 92410, 5211),
 (374, 'Lisa', 'Lee', '228 Myers Mountains Suite 721', 'Burnsport', 19840, 8260),
 (420, 'Amy', 'Lee', '81564 Rebecca Bypass', 'Nicholasberg', 13176, 4722),
 (437, 'Susan', 'Lee', '6289 Anthony Station', 'Garciamouth', 8512, 2078),
 (466, 'Roger', 'Ray', '28960 Tracy Estates Suite 214', 'Boyerville', 69484, 8872),
 (480, 'Geoffrey', 'Ray', '28512 Hunt Wells', 'East Reginaldberg', 15931, 2416),
 (484, 'Elizabeth', 'Lee', '8190 Madison Way', 'South Sheena', 20758, 9414),
 (525, 'Emily', 'Fox', '18459 Adam Walks Suite 261', 'Houseside', 87762, 2070),
 (545, 'Melissa', 'Day', '274 Jennifer Shoal Apt. 346', 'East Phillip', 87336, 1339),
 (588, 'Ernest', 'Fox', '24854 Benson Junction Apt. 200', 'Arthurberg', 46487, 1591),
 (715, 'Patricia', 'Gay', '087 Bryant Stream', 'Lake Hannahshire', 18247, 2842),
 (760, 'Erik', 'Cox', '840 Downs Trace', 'Williamsfurt', 85461, 8836),
 (868, 'Kristy', 'May', '0790 Karen Springs Apt. 927', 'North Cynthia', 80734, 994),
 (877, 'John', 'Cox', '31030 Smith Mount', 'Mcgeestad', 97041, 1329),
 (946, 'Jonathon', 'Day', '402 Moody Parkway', 'Rodriguezshire', 96430, 7108)]

In [12]:
# for numeric columns we can also use our regular numeric operators
%sql select * from person where index <2

 * postgres://jovyan:***@localhost:5432/si330
2 rows affected.

[(0, 'Amanda', 'Miller', '4302 John Skyway Apt. 650', 'West Victor', 55311, 4910),
 (1, 'Monica', 'Jenkins', '2794 Danielle Skyway Suite 323', 'West Jenniferport', 91875, 910)]

In [13]:
# SQL uses an odd syntax for not equals, the <> operator
%sql select * from person where index <> 2 limit 5

 * postgres://jovyan:***@localhost:5432/si330
5 rows affected.

[(0, 'Amanda', 'Miller', '4302 John Skyway Apt. 650', 'West Victor', 55311, 4910),
 (1, 'Monica', 'Jenkins', '2794 Danielle Skyway Suite 323', 'West Jenniferport', 91875, 910),
 (3, 'Mark', 'Cowan', '4026 Timothy Court', 'New Sarah', 40411, 8764),
 (4, 'Amber', 'King', '74417 Warren Ways Apt. 647', 'South Kelly', 40440, 6046),
 (5, 'Allison', 'Silva', '68090 Taylor Harbor', 'South Robertton', 82971, 4895)]

In [24]:
%sql select * from person where index != 2 limit 5

 * postgres://jovyan:***@localhost:5432/si330
5 rows affected.

[(0, 'Amanda', 'Miller', '4302 John Skyway Apt. 650', 'West Victor', 55311, 4910),
 (1, 'Monica', 'Jenkins', '2794 Danielle Skyway Suite 323', 'West Jenniferport', 91875, 910),
 (3, 'Mark', 'Cowan', '4026 Timothy Court', 'New Sarah', 40411, 8764),
 (4, 'Amber', 'King', '74417 Warren Ways Apt. 647', 'South Kelly', 40440, 6046),
 (5, 'Allison', 'Silva', '68090 Taylor Harbor', 'South Robertton', 82971, 4895)]

In [25]:
# we can chain multiple where comparisons together using AND
%sql select * from person where index <100 and index > 20 and first_name like '%ar%' limit 5

 * postgres://jovyan:***@localhost:5432/si330
5 rows affected.

[(21, 'Howard', 'Brown', '60122 Miller Street Apt. 853', 'West Edwinside', 60598, 6985),
 (24, 'Sara', 'Jones', '59767 Ray Squares Suite 908', 'South Tim', 91692, 4600),
 (35, 'Edward', 'Collins', '62798 Amanda Forks', 'South Michelle', 46109, 5314),
 (52, 'Tara', 'Daniels', '583 Laura Road Apt. 049', 'South Jessica', 50028, 1407),
 (53, 'Zachary', 'Jones', '318 Murphy Course Apt. 184', 'South Tinaland', 37867, 3304)]

In [ ]:
# how would you have written the above in pandas?

In [26]:
# another nice function in sql for ranges is BETWEEN and NOT BETWEEN (which are inclusive)
%sql select * from person where index between 10 and 13

 * postgres://jovyan:***@localhost:5432/si330
4 rows affected.

[(10, 'Heather', 'Huber', '56064 Colleen Mall Suite 443', 'New Elizabethside', 15595, 575),
 (11, 'Eric', 'Castaneda', '9497 Shannon Greens', 'Julieberg', 16296, 9229),
 (12, 'Corey', 'Smith', '499 Nathaniel Stravenue', 'East Davidtown', 61382, 3546),
 (13, 'Henry', 'Chavez', '74215 James Plaza', 'East Robinville', 10850, 9374)]

In [27]:
# another important operator is IN, which does set comparison
%sql select * from person where first_name in ('Christopher','Michael','George') limit 10

 * postgres://jovyan:***@localhost:5432/si330
10 rows affected.

[(22, 'Christopher', 'Caldwell', '4163 Marshall Alley', 'Lake Davidview', 49487, 9127),
 (47, 'Christopher', 'May', '45898 Jackson Islands', 'Mathewborough', 60118, 914),
 (88, 'Christopher', 'Olson', '29907 Lisa Lakes Apt. 825', 'Mayomouth', 40316, 681),
 (100, 'Christopher', 'Duncan', '041 Morris Lakes', 'East Rebecca', 6496, 6312),
 (147, 'Michael', 'Larson', '090 Nichols Valley Suite 019', 'Rayport', 50329, 5369),
 (203, 'Michael', 'Lopez', '13010 Evans Valleys', 'Carolinetown', 99299, 5469),
 (267, 'Michael', 'Ayala', '33385 Gardner Mount Apt. 885', 'Monicamouth', 16720, 7713),
 (272, 'Michael', 'Rodriguez', '80850 Rebecca View Suite 451', 'Debraburgh', 42822, 9985),
 (280, 'Michael', 'Cruz', '0723 Drew Way', 'South Bradley', 21350, 8760),
 (349, 'Michael', 'Gardner', '6355 Kyle Spur', 'Dunnfurt', 76831, 8301)]

In [ ]:
# it is common to format your sql statements over multiple lines, and in jupyter we can do 
# this with the sql cell magic (starts with %%)
# we use -- to denote a comment

In [28]:
%%sql
select first_name, last_name, street_address
from person
where first_name like 'Chris%' -- name has to start with chris
and last_name like '____' -- name has to end with five characters
-- note that all the text highlighting/code formatting is off because jupyter 
-- things this is python

 * postgres://jovyan:***@localhost:5432/si330
2 rows affected.

[('Christopher', 'Wise', '27594 Tonya Rue'),
 ('Christine', 'Lara', '2281 Lee Road')]

In [29]:
# in sql we can use aggregation functions as well.
# An aggregation converts a vector into a scalar, just like in pandas
# lots of values in, one value out.
# we use these on the columns
%sql select count(first_name) from person
# How many first_name rows are there in the table person?

 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.

[(1000,)]

In [30]:
# It's more common to see people count all of the columns, functionally there is a difference but the pattern is so common
# datbases return the result quickly. Of course, the length (count) of each column is the same
%sql select count(*) from person

 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.

[(1000,)]

In [31]:
# lots of other aggregation functions exist as you might expect
%sql select max(index) from person

 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.

[(999,)]

In [32]:
%sql select max(index), min(index), count(*) from person

 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.

[(999, 0, 1000)]

In [33]:
%sql select max(first_name) from person

 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.

[('Zachary',)]

In [ ]:
# this is an interesting query, because the return table has one row, three columns, and is just a bunch of
# summary information. Remember, the return value of a select statement is always itself a table (relation)
# How might we try and get a list of all unique firstnames with a count of how many occur 
# in our dataset?

In [34]:
%sql select count(first_name), first_name from person

 * postgres://jovyan:***@localhost:5432/si330
(psycopg2.errors.GroupingError) column "person.first_name" must appear in the GROUP BY clause or be used in an aggregate function
LINE 1: select count(first_name), first_name from person
                                  ^

[SQL: select count(first_name), first_name from person]
(Background on this error at: http://sqlalche.me/e/13/f405)

In [ ]:
# this doesn't do what we want, just like in pandas we need to tell SQL how we want to 
# group the data. once we group the data then the return result is just a combination 
# of the aggregation functions

In [41]:
%%sql 
select first_name as firstname_nounderscore, count(first_name) as awesome_column
from person 
group by first_name 
order by first_name
limit 5

 * postgres://jovyan:***@localhost:5432/si330
5 rows affected.

[('Aaron', 2), ('Abigail', 2), ('Adam', 6), ('Alejandro', 1), ('Alex', 1)]

In [ ]:
# this is just like we've been doing in pandas!

In [42]:
%%sql
select first_name, count(*) 
from person 
where first_name like 'Chris%' 
group by first_name

 * postgres://jovyan:***@localhost:5432/si330
5 rows affected.

[('Christian', 2),
 ('Christina', 1),
 ('Christine', 6),
 ('Christopher', 13),
 ('Christy', 1)]

In [ ]:
# just like in pandas we can group by multiple columns. This means we need a unique 
# combination of the two columns
# remember that cell magics (%%) must start the cell, can't have comments up top :(

In [47]:
%%sql
select first_name, last_name, count(*) as num
from person
where first_name like 'Chris%'
group by first_name, last_name
order by num desc
limit 5

 * postgres://jovyan:***@localhost:5432/si330
5 rows affected.

[('Christian', 'Peterson', 1),
 ('Christina', 'Sandoval', 1),
 ('Christine', 'Brady', 1),
 ('Christine', 'Hogan', 1),
 ('Christian', 'Johnson', 1)]

In [48]:
# we can have other functions operate on columns as well these functions can be user 
# defined (hard, unusual) or are more likely built into the rdbms. 
# They are not standard so each engine has it's own set of functions
# Often this breaks with SQL norms as well, which can be frustrating for portability
%sql select * from person where first_name ~ '[A|B|C].*' limit 5
# this returns the number of people who have a name starting with A B or C
# yum, regex!

 * postgres://jovyan:***@localhost:5432/si330
5 rows affected.

[(0, 'Amanda', 'Miller', '4302 John Skyway Apt. 650', 'West Victor', 55311, 4910),
 (4, 'Amber', 'King', '74417 Warren Ways Apt. 647', 'South Kelly', 40440, 6046),
 (5, 'Allison', 'Silva', '68090 Taylor Harbor', 'South Robertton', 82971, 4895),
 (6, 'Cindy', 'Lewis', '7553 Watkins Curve Apt. 427', 'Brendaport', 16142, 7494),
 (8, 'Cynthia', 'Wilkerson', '013 Tim Track Suite 187', 'North Patriciaport', 65340, 5842)]

In [ ]:
# ok, you've heard me say again and again that every select returns a table, and we 
# know that select statements work on tables, so why not have a select statement work on 
# a select statement result?

# These are called subselects, and it's a beautiful beautiful thing!

In [52]:
%%sql 
select * from person where first_name in (
    select first_name from person where city like 'Port%') and index <100

 * postgres://jovyan:***@localhost:5432/si330
24 rows affected.

[(2, 'Keith', 'Richards', '395 Lloyd Route Apt. 439', 'Port Ashleyville', 1667, 9970),
 (8, 'Cynthia', 'Wilkerson', '013 Tim Track Suite 187', 'North Patriciaport', 65340, 5842),
 (9, 'Brian', 'Kaufman', '0799 Bean Turnpike', 'North Aaron', 89927, 9705),
 (11, 'Eric', 'Castaneda', '9497 Shannon Greens', 'Julieberg', 16296, 9229),
 (27, 'Tiffany', 'Carroll', '91375 Charles Knolls Suite 385', 'Dawnview', 69930, 5511),
 (30, 'Joseph', 'Moore', '7666 Pamela Junctions', 'North Peggyfort', 99187, 2872),
 (36, 'Eric', 'Strickland', '4116 Henry Curve', 'West Brucechester', 84534, 5465),
 (38, 'Traci', 'Carter', '75676 Simon Causeway', 'Port Mariah', 28378, 7342),
 (48, 'William', 'Robinson', '5531 Sarah Trace Suite 854', 'Port Lauraport', 1541, 4203),
 (60, 'Cheryl', 'Murphy', '6028 Maxwell Estate', 'Pricefort', 54893, 9749),
 (62, 'Erin', 'Thompson', '713 Griffith Stravenue', 'Port Brandontown', 87776, 8850),
 (65, 'Daniel', 'Leach', '867 Danielle Groves', 'Jamesstad', 91145, 7527),
 (67, 'Ashley', 'Murphy', '655 Troy Gardens Suite 178', 'South Briannaton', 65704, 9758),
 (70, 'Keith', 'Schmidt', '04849 Vaughan Meadow Apt. 534', 'North Nicholasside', 69094, 1169),
 (71, 'Cheryl', 'Johnson', '10852 Lisa Crescent Apt. 168', 'Port Michael', 18757, 2900),
 (75, 'Keith', 'Butler', '69166 Roy Plains Suite 436', 'West Morgan', 55739, 5659),
 (79, 'Ryan', 'Mason', '87534 Hill Pine Suite 127', 'Port Karen', 6705, 9312),
 (84, 'Erin', 'Fitzgerald', '589 Ellis Avenue Suite 689', 'Tammyhaven', 25763, 8256),
 (86, 'Holly', 'Meyers', '542 Jefferson Mountains', 'Port Brian', 81496, 6201),
 (90, 'Todd', 'Guerrero', '846 Fox Unions', 'Port Rebecca', 99247, 8625),
 (96, 'Eric', 'Miller', '18927 Brooks Flat Apt. 898', 'Lake Samuel', 44601, 542),
 (97, 'Jason', 'Shea', '97826 Rachel Trail', 'Port Danielle', 51030, 6834),
 (98, 'Melissa', 'Brown', '4736 Owen Shoal Suite 086', 'Lake Gary', 41820, 4699),
 (99, 'William', 'Short', '1835 Cynthia Via Suite 392', 'Lake Timothyport', 70578, 3384)]

In [64]:
%%sql 
select avg(price), stddev(price), count(*) as num, credit_card_provider 
from sales 
group by credit_card_provider


sales.groupby('credit_card_provider').apply({'price':[np.avg,np.stddev],'count':len})

 * postgres://jovyan:***@localhost:5432/si330
10 rows affected.

[(Decimal('5656.8307692307692308'), Decimal('2759.590558223894'), 65, 'VISA 13 digit'),
 (Decimal('4483.1363636363636364'), Decimal('2868.016741107473'), 66, 'JCB 15 digit'),
 (Decimal('5484.7100000000000000'), Decimal('2698.310606133348'), 100, 'Discover'),
 (Decimal('5048.5783132530120482'), Decimal('2989.051832370446'), 83, 'Mastercard'),
 (Decimal('5158.4444444444444444'), Decimal('2728.895146175621'), 99, 'Maestro'),
 (Decimal('4769.7032967032967033'), Decimal('2753.177346245225'), 91, 'VISA 19 digit'),
 (Decimal('5181.9290322580645161'), Decimal('2936.111453769569'), 155, 'JCB 16 digit'),
 (Decimal('5295.3882352941176471'), Decimal('2825.668602270964'), 85, 'American Express'),
 (Decimal('4897.3333333333333333'), Decimal('3003.573713095785'), 81, 'Diners Club / Carte Blanche'),
 (Decimal('5389.0171428571428571'), Decimal('2877.527381805040'), 175, 'VISA 16 digit')]